<template>
  <div class="faq-container">
    <div class="text-container">
      <h1 class="title_font faq-title">자주 하는 질문</h1>
      <p class="faq-text font_m">미드림성형외과에 대해 자주 묻는 질문을 모아둔 공간입니다.</p>
    </div>

    <v-expansion-panels>
      <v-expansion-panel
        v-for="(qa, index) in qaList"
        :key="index"
      >
        <v-expansion-panel-title v-html="qa.question"/>
        <v-expansion-panel-text v-html="qa.answer" class="pa-5 faq-bg"/>
      </v-expansion-panel>
    </v-expansion-panels>
  </div>
</template>

<script setup>
import { ref } from 'vue'

const qaList = ref([
  {
    question: '<b>Q. 어울리는 쌍꺼풀 라인을 찾기 어려워요. 원하는 수술을 받을 수 있을까요?</b>',
    answer: 'A. 상담시 솔직하고 편한 마음으로 본인의 의견을 제시하면 됩니다. 미드림에서는 환자분의 희망하는 바에 따라 가장 적합한 수술방법을 제안하게 되며 환자분 개개인의 눈꺼풀의 상태에 따라 최적의 수술방법이 결정됩니다. 수술후 문제가 되는 수술이나 확신이 서지 못하는 경우에는 어떠한 경우에도 수술을 권하거나 수술을 하지 않습니다.',
  },
  {
    question: '<b>Q. 쌍꺼풀 수술에서 매몰법의 실은 끊어지지 않나요?</b>',
    answer: 'A. 정확하고 섬세한 수기에 의해 실의 긴장도를 조절하고 매듭을 만듭니다. 따라서, 실이 끊기는 경우는 거의 없고, 만일의 경우 쌍꺼풀이 약해지거나 문제가 생긴다고 하더라도 추가적인 비용없이 언제든지 추후교정을 시행해 드리고 있습니다. 또한, 환자분의 쌍꺼풀 형태상 매몰법으로는 풀리기 쉬운 경우에는 다른 수술방법을 추천하여 드리므로 충분한 설명을 들으시고 수술을 받으시게 되므로 안심하셔도 됩니다.',
  },
  {
    question: '<b>Q. 쌍꺼풀 수술시 수술할 때와 수술 후에 많이 아픈가요?</b>',
    answer: 'A. 안약을 이용한 점안마취와 국소마취를 병행하므로 수술과정에서의 고통은 없습니다. 수술 후에도 내복약을 통해 통증이 조절되므로 걱정하지 않으셔도 됩니다',
  },
  {
    question: '<b>Q. 좌우의 눈이 균형이 안 맞아서 고민입니다. 균형에 맞게 고칠 수 있나요?</b>',
    answer: 'A. 얼굴이나 몸 등 원래부터 좌우가 정확히 대칭이 되는 경우는 없습니다.다만, 홑 꺼풀의 눈이 비대칭인 경우 쌍꺼풀수술을 통해, 얼굴 전체의 균형을 보면서 자연스럽게 밸런스를 맞출 수 있습니다. <br> 한쪽눈만 쌍거풀이 있는 경우에는 한쪽 눈만의 쌍꺼풀 수술을 통해 자연스러운 얼굴 모습을 갖도록 수술을 진행할 수도 있습니다',
  },
  {
    question: '<b>Q. 쌍꺼풀 수술시 수술할 때와 수술 후에 많이 아픈가요?</b>',
    answer: 'A. 안약을 이용한 점안마취와 국소마취를 병행하므로 수술과정에서의 고통은 없습니다. 수술 후에도 내복약을 통해 통증이 조절되므로 걱정하지 않으셔도 됩니다',
  },
  {
    question: '<b>Q. 쌍꺼풀이 이미 있는데, 크기를 바꿀 수 있나요?</b>',
    answer: 'A. 인폴드를 아웃폴드로 바꾸거나, 내안각(몽고주름) 교정술 또는 외안각(바깥 트임) 수술 등을 병행하여 시원스러운 눈으로 교정할 수 있습니다. 환자분의 희망에 맞추어 쌍꺼풀의 폭의 교정은 가능하며, 상세한 사항은 전문의와 직접 상담하셔야 합니다.',
  },
  {
    question: '<b>Q. 풀이나 테이프로 쌍꺼풀을 만들었습니다. 이런 경우 쌍꺼풀 수술을 받을 수 있나요?</b>',
    answer: 'A. 풀이나 테이프를 사용하더라도 심각한 문제가 아니라면 쌍꺼풀 수술은 가능하므로 일단은 안심하셔도 됩니다. 쌍꺼풀을 만들기 위해 성형 수술을 받는 것이 가장 빠른 방법이지만 수술을 받기가 겁이 나거나 혹은 나이가 어려서 수술을 받기에 적당하지 않은 나이이거나, 아직은 학생이기 때문에 나중에 성형수술을 받기로 계획하고 있는 경우 등 여러가지 이유로 쌍꺼풀 수술을 고려하지 못하는 사람들이 많습니다. <br><br> &nbsp; 이런 분들이 쌍꺼풀 라인을 만들기 위해 풀이나 테이프를 장기간 사용하게 되면 눈꺼풀에 여러가지 문제가 생기게 되어, 쌍꺼풀 수술을 못받게 되는 것은 아닌지 걱정하시는 분들이 있습니다. 풀이나 테이프를 장기간 사용하였을 때 발생하는 문제들은 <br><br> 피부의 각질화 <br> 진피층의 비후(두터워짐) <br> 잔주름의 생성 <br> 피부의 늘어짐 <br><br> 정도가 대표적인 문제이며, 증상이 심한 경우에는 수술에 지장을 줄 수도 있습니다. <br><br> &nbsp; 하지만 일반적으로는 사용을 중지하고 시간이 조금 경과하면 증상은 없어지거나 가라 앉게 되지만, 지나치게 장기간 사용한 경우에는 복원이 불가능한 경우도 있으므로  가급적 사용을 중지 하는 것이 좋습니다. 만일 풀이나 테이프를 사용하지 않으면 외출이 불가능하기 때문에 아침마다 꼭 사용을 하여야 한다면, 눈의 건강을 위해서라도 빨리 쌍꺼풀 수술을 고려하시는 편이 현명합니다.',
  },
  {
    question: '<b>Q. 매몰식 쌍꺼풀 수술은 절개식에 비해 수술후 일정시간이 지나면 풀리지 않나요?</b>',
    answer: 'A. 매몰식 쌍꺼풀 수술은 흉터를 만들지 않고 봉합사의 주행을 이용하여 라인을 만들어 주게 되므로 시간이 지나면 풀어질 확률도 있습니다.  하지만 수술후 라인이 풀어졌다고 오시는 환자들의 대부분은 쌍꺼풀 라인이 풀어진 것이 아니고 나이가 들면서 혹은 시간이 지나면서 라인이 느슨하여 지거나 피부가 늘어져 쌍꺼풀이 적어진 경우가 대부분이며, 완전히 풀어진 경우는 극히 드문 경우입니다. 절개식 수술에서도 흉터를 따라 만드는 라인이 풀어지는 경우가 있으며, 단지 그 비율이 매몰식에 비해 상대적으로 적은 정도입니다. <br><br> &nbsp; 매몰식 수술에서 여러가지 문제로 재수술하는 환자의 비율도 저희 병원의 경우 불과 1~3 % 미만이며 라인이 풀어져 재수술을 받아야 할 가능성은 지극히 낮습니다.  특히 최근 미드림에서 시행하는 단매듭 연속 매몰식의 쌍거풀 수술은 Multi-Bridge, Multi-Loop Technique을 각 환자에 맞도록 적용하고 있기 때문에 풀어질 가능성은 상당히 낮습니다.  중요한 점은 재수술의 가능 유무와 이에 따른 수술후의 결과입니다.  매몰식 수술은 흉터가 없이 봉합사로만 라인을 만들기 때문에 재수술이 쉽고 간단하며 수술후의 결과가 자연스러운 장점이 있습니다.  미드림에서는 쌍꺼풀 수술 후 문제가 생겨 교정이 필요한 경우에는 언제든지 무료로 Touch-Up을 시행하고 있으므로 안심하시고 수술을 받으셔도 됩니다.',
  },
  {
    question: '<b>Q. 코성형시 삽입되는 재료인 실리콘과 고어텍스 중에 어떤 재료가 더 좋은가요?</b>',
    answer: 'A. 코를 높이는 수술에 사용되는 재료는 여러 가지가 있고, 각각 그 소재마다의 특성이 있으나 실리콘과 고어텍스 보형물이 현재 가장 많이 사용되는 재료이고 안전성을 인증받은 가장 우수한 소재입니다. <br><br> &nbsp; 전문의와 환자분과의 직접 진료와 상담을 통해 환자에게 가장 적합한 소재를 결정하게 되며 어떤 소재가 천편일률적으로 더 우수하다고 판단하기는 어렵고 환자의 상태에 따라 필요한 소재를 사용해 수술하는 것이 필요합니다.',
  },
  {
    question: '<b>Q. 코를 성형하면 수술후 티가 많이 난다는데 자연스럽게 수술이 가능한가요?</b>',
    answer: 'A. 성형수술은 환자분의 요구사항을 반영하여 전문의의 소견을 피력하는 것이고 환자분의 의지가 수술을 좌우하게 되는 경우가 많습니다. 물론 무리한 요구를 하시는 경우의 문제점이나 주의사항 등은 충분히 상담시 이야기해드리고 있습니다. <br><br> 코의 형태를 바꾸는 경우 몇 cm씩 바꾸는 것이 아니고, 몇 mm의 범위로 조정하면서 균형과 조화를 맞추게 됩니다. 따라서, 환자분의 무리한 요구사항이 없다면 본인의 얼굴과 어울리는 자연스러운 코 성형이 충분히 가능합니다.',
  },
  {
    question: '<b>Q. 레스틸렌 주사로 코를 높이는 경우, 지속기간은 어느 정도인가요?</b>',
    answer: 'A. 레스틸렌의 주된 구성성분인 하이알루론산은 대개 주입 후 1년에서 1년 반 사이에 체내에 흡수됩니다. 개인차가 있지만, 평균적으로 9개월 정도 유지된다고 예상하면 됩니다.',
  },
  {
    question: '<b>Q. 코끝 부분만의 성형도 가능한가요?</b>',
    answer: 'A. 콧대의 높이는 좋은데 코끝이 두툼하고 뭉뚝해 보이는 경우에는 코끝만의 성형을 통해 전체의 조화를 이룰 수 있습니다. 코끝만의 성형은 단독적으로 많이 행해지는 수술이고 보통의 경우 본인의 연골을 주된 소재로 사용하므로, 매우 안전하고 효과적인 수술입니다. 연골간 봉합, 코기둥 삽입, 연골이식 등의 수기가 사용됩니다.',
  },
  {
    question: '<b>Q. 얼굴이 커서 걱정입니다. 작은 얼굴이 되려면 어떤 수술을 받는 것이 좋을까요?</b>',
    answer: 'A. 얼굴을 구성하는 요소로는 뼈, 근육, 지방 등이 있습니다.  얼굴이 크고 각이 져 보이고 남성적인 느낌을 주는 이유에 따라  적절한 방법을 선택하시면 됩니다. 뼈가 원인인 경우 사각턱 및 광대뼈 축소술을 택하게 되며, 턱의 근육이 발달된 경우에는 보톡스 주사가 효과적입니다.  볼이 통통한 경우 볼 지방 제거의 방법이 있으므로 본인의 상태에 가장 적합한 방법을 전문의와 상담후 시술하시면 됩니다. 위의 열거한 방법들을 모두 병용하는 경우,  한 두 가지를 택하는 경우 등 여러 방법이 존재할 수 있으므로, 의사와의 전문적인 상담을 통해 수술방법을 결정하는 것이 적절합니다.',
  },
  {
    question: '<b>Q. 보톡스 주사 후 얼마의 기간이 지나야 효과가 나타나나요?</b>',
    answer: 'A. 개인차가 있지만 보통 주사 후 1개월 후부터 효과가 나타납니다.',
  },
  {
    question: '<b>Q. 보톡스 주사의 지속기간은 어느 정도인가요?</b>',
    answer: 'A. 지속기간은 개인차가 있지만 짧게는 6개월에서 길게는 2년 정도라고 보시면 됩니다. 보통 처음 주사 후 6개월 후에 재차 주사할 경우 1년 6개월까지의 지속효과를 기대할 수 있습니다.',
  },
])
</script>

<style>
.faq-container{
  width: 96%;
  /* border: 1px solid red; */
  margin: 0 auto;
  margin-bottom: 150px;
}

.text-container{
  margin-bottom: 40px;
}

.faq-title{
  font-size: 64px;
  margin-bottom: 324x;
}

.faq-text{
  font-size: 24px;
}

.faq-bg{
  background-color: #EEE9F0;
}
</style>